# Azamat Khankhodjaev
# 04.10.2020
# 6. Продолжить работу над вторым заданием. Реализуйте механизм валидации вводимых пользователем данных. Например,
# для указания количества принтеров, отправленных на склад, нельзя использовать строковый тип данных.
# Подсказка: постарайтесь по возможности реализовать в проекте «Склад оргтехники» максимум возможностей,
# изученных на уроках по ООП.
from homeworks.less8_4 import OfficeEquipment, Printer, Scaner, Xerox
if __name__ == '__main__':
    # p = Printer('333','цветной')
    s = Scaner('333')